# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr
# by: CSDN Limiiiing
# Parameters
ch: 6
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1 - RGB
  - [-2, 1, Multiin, [2]]  # 2 - IR

  # RGB Branch: Color-Oriented
  - [1, 1, HGStem, [32, 48]]  # 3
  - [-1, 6, CGDEM, [48, 128, 3]]  # 4 - 颜色导向

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 5
  - [-1, 6, CGDEM, [96, 128, 3]]  # 6 - 颜色导向@   ################改了通道数，因为下面的idea改了通道这里不该融合不了=【。 

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 7
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]  # 8
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]   # 9
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]   # 10

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 11
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]  # 12

  # IR Branch: Thermal-Oriented
  - [2, 1, HGStem, [32, 48]]  # 13
  - [-1, 6, MSWC, [48, 48, 3]]  # 14 - 热导向

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 15
  - [-1, 6, MSWC, [96, 128, 3]]  # 16 - 热导向

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 17
  - [-1, 6, HGBlock, [192, 1024, 5, False, False]]  # 18
  - [-1, 6, HGBlock, [192, 1024, 5, False, True]]   # 19
  - [-1, 6, HGBlock, [192, 1024, 5, False, True]]   # 20

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 21
  - [-1, 6, HGBlock, [384, 2048, 5, False, False]]  # 22



  - [[6, 16], 1, CM_CHF, []]  # 23 cat backbone P3
  - [[10, 20], 1, CM_CHF, []]  # 24 cat backbone P4
  - [[12, 22], 1, CM_CHF, []]  # 25 cat backbone P5



head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 26 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]] # 28, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [24, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 30 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 32, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 33, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [23, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 35 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, RepC3, [256]] # X3 (37), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 38, downsample_convs.0
  - [[-1, 33], 1, Concat, [1]] # cat Y4
  - [-1, 3, RepC3, [256]] # F4 (40), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 41 downsample_convs.1
  - [[-1, 28], 1, Concat, [1]] # cat Y5
  - [-1, 3, RepC3, [256]] # F5 (43), pan_blocks.1

  - [[37, 40, 43], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
